Revit 2026 API

# ImageResolution Enumeration

---

This enum is used to define image resolution in order to calculate the image size.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ImageResolution
```
```vb
Public Enumeration ImageResolution
```
```cpp
public enum class ImageResolution
```
```fsharp
type ImageResolution
```

| Member name | Value | Description |
| --- | --- | --- |
| DPI_150 | 1 | 150 dpi |
| DPI_300 | 2 | 300 dpi |
| DPI_600 | 3 | 600 dpi |
| DPI_72 | 0 | 72 dpi |

This is used only if the Zoom option for ZoomType is set.

#### Reference

Autodesk.Revit.DB Namespace